app/Controllers/HasilPanen.php

SELECT *
FROM `hasil_panen`
WHERE `hasil_panen`.`deleted_at` IS NULL
AND `hasil_panen`.`id` = 64
SELECT *
FROM `petugas`
WHERE `status` = 'aktif'
AND `petugas`.`deleted_at` IS NULL
---
    public function edit(int $id)
    {
        $model = new HasilPanenModel();
        $panen = $model->find($id);
        if (! $panen) {
            $this->notifikasi('error', 'Data tidak ditemukan');
            return redirect()->to('/hasil-panen');
        }

        $rumahModel   = new RumahWaletModel();
        $petugasModel = new PetugasModel();

        return $this->render('hasil_panen/edit', [
            'title'           => 'Edit Hasil Panen',
            'panen'           => $panen,
            'rumahList'       => $rumahModel->getAktif(),
            'petugasList'     => $petugasModel->where('status', 'aktif')->findAll(),