app/Controllers/Laporan.php

SELECT `hasil_panen`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `petugas`.`nama` AS `petugas_nama`
FROM `hasil_panen`
JOIN `rumah_walet` ON `rumah_walet`.`id` = `hasil_panen`.`rumah_walet_id`
JOIN `petugas` ON `petugas`.`id` = `hasil_panen`.`petugas_id`
WHERE `hasil_panen`.`tanggal_panen` >= '2026-01-01'
AND `hasil_panen`.`tanggal_panen` <= '2026-07-06'
ORDER BY `hasil_panen`.`tanggal_panen` DESC
SELECT *
FROM `rumah_walet`
WHERE `rumah_walet`.`deleted_at` IS NULL
---
    public function panen()
    {
        $dari   = $this->request->getGet('dari') ?? date('Y-01-01');
        $sampai = $this->request->getGet('sampai') ?? date('Y-m-d');
        $grade  = $this->request->getGet('grade');
        $rumah  = $this->request->getGet('rumah_walet_id');

        $db = \Config\Database::connect();
        $builder = $db->table('hasil_panen')
            ->select('hasil_panen.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, petugas.nama AS petugas_nama')
            ->join('rumah_walet', 'rumah_walet.id = hasil_panen.rumah_walet_id')
            ->join('petugas', 'petugas.id = hasil_panen.petugas_id')
            ->where('hasil_panen.tanggal_panen >=', $dari)
            ->where('hasil_panen.tanggal_panen <=', $sampai);

        if (! empty($grade)) $builder->where('hasil_panen.grade', $grade);
        if (! empty($rumah)) $builder->where('hasil_panen.rumah_walet_id', $rumah);

        $rows = $builder->orderBy('hasil_panen.tanggal_panen', 'DESC')->get()->getResultArray();

        $rumahModel = new RumahWaletModel();
        return $this->render('laporan/panen', [
            'title'    => 'Laporan Hasil Panen',
            'data'     => $rows,
            'dari'     => $dari,
            'sampai'   => $sampai,
            'grade'    => $grade,
            'rumah_id' => $rumah,
            'rumahList'=> $rumahModel->findAll(),

SELECT `pengeluaran`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `users`.`nama` AS `input_nama`
FROM `pengeluaran`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `pengeluaran`.`rumah_walet_id`
LEFT JOIN `users` ON `users`.`id` = `pengeluaran`.`input_by`
WHERE `pengeluaran`.`tanggal` >= '2026-01-01'
AND `pengeluaran`.`tanggal` <= '2026-07-06'
ORDER BY `pengeluaran`.`tanggal` DESC
SELECT *
FROM `rumah_walet`
WHERE `rumah_walet`.`deleted_at` IS NULL
---
    public function pengeluaran()
    {
        $dari     = $this->request->getGet('dari') ?? date('Y-01-01');
        $sampai   = $this->request->getGet('sampai') ?? date('Y-m-d');
        $kategori = $this->request->getGet('kategori');

        $db = \Config\Database::connect();
        $builder = $db->table('pengeluaran')
            ->select('pengeluaran.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, users.nama AS input_nama')
            ->join('rumah_walet', 'rumah_walet.id = pengeluaran.rumah_walet_id', 'left')
            ->join('users', 'users.id = pengeluaran.input_by', 'left')
            ->where('pengeluaran.tanggal >=', $dari)
            ->where('pengeluaran.tanggal <=', $sampai);

        if (! empty($kategori)) $builder->where('pengeluaran.kategori', $kategori);

        $rows = $builder->orderBy('pengeluaran.tanggal', 'DESC')->get()->getResultArray();
        $rumahModel = new RumahWaletModel();

        return $this->render('laporan/pengeluaran', [
            'title'         => 'Laporan Pengeluaran',
            'data'          => $rows,
            'dari'          => $dari,
            'sampai'        => $sampai,
            'kategori'      => $kategori,
            'kategori_list' => Constants::KATEGORI_PENGELUARAN,
            'rumahList'     => $rumahModel->findAll(),

SELECT `rumah_walet`.`kode`, `rumah_walet`.`nama`, `rumah_walet`.`kapasitas_panen_kg`, `rumah_walet`.`kondisi`, COALESCE(SUM(hasil_panen.berat_kg), 0) AS total_panen, COALESCE(SUM(hasil_panen.berat_kg * hasil_panen.harga_per_kg), 0) AS total_nilai, COUNT(DISTINCT hasil_panen.id) AS jumlah_panen, COALESCE(SUM(pengeluaran.jumlah), 0) AS total_pengeluaran
FROM `rumah_walet`
LEFT JOIN `hasil_panen` ON `hasil_panen`.`rumah_walet_id` = `rumah_walet`.`id` AND YEAR(hasil_panen.tanggal_panen) = 2026
LEFT JOIN `pengeluaran` ON `pengeluaran`.`rumah_walet_id` = `rumah_walet`.`id` AND YEAR(pengeluaran.tanggal) = 2026
WHERE `rumah_walet`.`status` = 'aktif'
GROUP BY `rumah_walet`.`id`
ORDER BY `total_panen` DESC
---
    public function produktivitas()
    {
        $tahun = (int) ($this->request->getGet('tahun') ?? date('Y'));
        $db = \Config\Database::connect();

        $rows = $db->table('rumah_walet')
            ->select('rumah_walet.kode, rumah_walet.nama, rumah_walet.kapasitas_panen_kg, rumah_walet.kondisi,
                      COALESCE(SUM(hasil_panen.berat_kg),0) AS total_panen,
                      COALESCE(SUM(hasil_panen.berat_kg * hasil_panen.harga_per_kg),0) AS total_nilai,
                      COUNT(DISTINCT hasil_panen.id) AS jumlah_panen,
                      COALESCE(SUM(pengeluaran.jumlah),0) AS total_pengeluaran')
            ->join('hasil_panen', 'hasil_panen.rumah_walet_id = rumah_walet.id AND YEAR(hasil_panen.tanggal_panen) = ' . $tahun, 'left')
            ->join('pengeluaran', 'pengeluaran.rumah_walet_id = rumah_walet.id AND YEAR(pengeluaran.tanggal) = ' . $tahun, 'left')
            ->where('rumah_walet.status', 'aktif')
            ->groupBy('rumah_walet.id')
            ->orderBy('total_panen', 'DESC')
            ->get()->getResultArray();