app/Models/AudioWaletModel.php

SELECT `audio_walet`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `u`.`nama` AS `input_by_nama`
FROM `audio_walet`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `audio_walet`.`rumah_walet_id`
LEFT JOIN `users` `u` ON `u`.`id` = `audio_walet`.`input_by`
WHERE `audio_walet`.`deleted_at` IS NULL
ORDER BY `audio_walet`.`tanggal` DESC
---
    public function getWithRelations(array $filters = [])
    {
        $builder = $this->builder();
        $builder->select('audio_walet.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, u.nama AS input_by_nama')
            ->join('rumah_walet', 'rumah_walet.id = audio_walet.rumah_walet_id', 'left')
            ->join('users u', 'u.id = audio_walet.input_by', 'left')
            ->where('audio_walet.deleted_at IS NULL');

        if (! empty($filters['rumah_walet_id'])) {
            $builder->where('audio_walet.rumah_walet_id', $filters['rumah_walet_id']);
        }
        if (! empty($filters['dari'])) {
            $builder->where('audio_walet.tanggal >=', $filters['dari']);
        }
        if (! empty($filters['sampai'])) {
            $builder->where('audio_walet.tanggal <=', $filters['sampai']);
        }

        return $builder->orderBy('audio_walet.tanggal', 'DESC')->get()->getResultArray();