app/Models/HasilPanenModel.php

    public function getWithRelations(int $id): ?array
    {
        return $this->select('hasil_panen.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, petugas.nama AS petugas_nama')
            ->join('rumah_walet', 'rumah_walet.id = hasil_panen.rumah_walet_id', 'left')
            ->join('petugas', 'petugas.id = hasil_panen.petugas_id', 'left')
            ->find($id);
---
SELECT `hasil_panen`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `petugas`.`nama` AS `petugas_nama`
FROM `hasil_panen`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `hasil_panen`.`rumah_walet_id`
LEFT JOIN `petugas` ON `petugas`.`id` = `hasil_panen`.`petugas_id`
WHERE `hasil_panen`.`deleted_at` IS NULL
AND `hasil_panen`.`id` = 64

    public function getAllWithRelations(array $filters = [])
    {
        $builder = $this->builder();
        $builder->select('hasil_panen.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, petugas.nama AS petugas_nama, jadwal_panen.tanggal_rencana AS jadwal_tanggal')
            ->join('rumah_walet', 'rumah_walet.id = hasil_panen.rumah_walet_id', 'left')
            ->join('petugas', 'petugas.id = hasil_panen.petugas_id', 'left')
            ->join('jadwal_panen', 'jadwal_panen.id = hasil_panen.jadwal_panen_id', 'left')
            ->where('hasil_panen.deleted_at IS NULL');

        if (! empty($filters['rumah_walet_id'])) {
            $builder->where('hasil_panen.rumah_walet_id', $filters['rumah_walet_id']);
        }
        if (! empty($filters['grade'])) {
            $builder->where('hasil_panen.grade', $filters['grade']);
        }
        if (! empty($filters['jenis_panen'])) {
            $builder->where('hasil_panen.jenis_panen', $filters['jenis_panen']);
        }
        if (! empty($filters['dari'])) {
            $builder->where('hasil_panen.tanggal_panen >=', $filters['dari']);
        }
        if (! empty($filters['sampai'])) {
            $builder->where('hasil_panen.tanggal_panen <=', $filters['sampai']);
        }

        return $builder->orderBy('hasil_panen.tanggal_panen', 'DESC')->get()->getResultArray();
---
SELECT `hasil_panen`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `petugas`.`nama` AS `petugas_nama`, `jadwal_panen`.`tanggal_rencana` AS `jadwal_tanggal`
FROM `hasil_panen`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `hasil_panen`.`rumah_walet_id`
LEFT JOIN `petugas` ON `petugas`.`id` = `hasil_panen`.`petugas_id`
LEFT JOIN `jadwal_panen` ON `jadwal_panen`.`id` = `hasil_panen`.`jadwal_panen_id`
WHERE `hasil_panen`.`deleted_at` IS NULL
ORDER BY `hasil_panen`.`tanggal_panen` DESC