app/Models/InspeksiModel.php

    public function getWithRelations(array $filters = [])
    {
        $builder = $this->builder();
        $builder->select('inspeksi.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, petugas.nama AS petugas_nama')
            ->join('rumah_walet', 'rumah_walet.id = inspeksi.rumah_walet_id', 'left')
            ->join('petugas', 'petugas.id = inspeksi.petugas_id', 'left')
            ->where('inspeksi.deleted_at IS NULL');

        if (! empty($filters['rumah_walet_id'])) {
            $builder->where('inspeksi.rumah_walet_id', $filters['rumah_walet_id']);
        }
        if (! empty($filters['dari'])) {
            $builder->where('inspeksi.tanggal_inspeksi >=', $filters['dari']);
        }
        if (! empty($filters['sampai'])) {
            $builder->where('inspeksi.tanggal_inspeksi <=', $filters['sampai']);
        }

        return $builder->orderBy('inspeksi.tanggal_inspeksi', 'DESC')->get()->getResultArray();
---
SELECT `inspeksi`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `petugas`.`nama` AS `petugas_nama`
FROM `inspeksi`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `inspeksi`.`rumah_walet_id`
LEFT JOIN `petugas` ON `petugas`.`id` = `inspeksi`.`petugas_id`
WHERE `inspeksi`.`deleted_at` IS NULL
ORDER BY `inspeksi`.`tanggal_inspeksi` DESC