app/Models/JadwalPanenModel.php

    public function getWithRelations(array $filters = [])
    {
        $builder = $this->builder();
        $builder->select('jadwal_panen.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama')
            ->join('rumah_walet', 'rumah_walet.id = jadwal_panen.rumah_walet_id', 'left')
            ->where('jadwal_panen.deleted_at IS NULL');

        if (! empty($filters['rumah_walet_id'])) {
            $builder->where('jadwal_panen.rumah_walet_id', $filters['rumah_walet_id']);
        }
        if (! empty($filters['status'])) {
            $builder->where('jadwal_panen.status', $filters['status']);
        }
        if (! empty($filters['dari'])) {
            $builder->where('jadwal_panen.tanggal_rencana >=', $filters['dari']);
        }
        if (! empty($filters['sampai'])) {
            $builder->where('jadwal_panen.tanggal_rencana <=', $filters['sampai']);
        }

        return $builder->orderBy('jadwal_panen.tanggal_rencana', 'DESC')->get()->getResultArray();
---
SELECT `jadwal_panen`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`
FROM `jadwal_panen`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `jadwal_panen`.`rumah_walet_id`
WHERE `jadwal_panen`.`deleted_at` IS NULL
ORDER BY `jadwal_panen`.`tanggal_rencana` DESC