app/Models/PengeluaranModel.php

SELECT `pengeluaran`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `u1`.`nama` AS `input_by_nama`, `u2`.`nama` AS `approved_by_nama`
FROM `pengeluaran`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `pengeluaran`.`rumah_walet_id`
LEFT JOIN `users` `u1` ON `u1`.`id` = `pengeluaran`.`input_by`
LEFT JOIN `users` `u2` ON `u2`.`id` = `pengeluaran`.`approved_by`
WHERE `pengeluaran`.`deleted_at` IS NULL
ORDER BY `pengeluaran`.`tanggal` DESC
---
    public function getWithRelations(array $filters = [])
    {
        $builder = $this->builder();
        $builder->select('pengeluaran.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, u1.nama AS input_by_nama, u2.nama AS approved_by_nama')
            ->join('rumah_walet', 'rumah_walet.id = pengeluaran.rumah_walet_id', 'left')
            ->join('users u1', 'u1.id = pengeluaran.input_by', 'left')
            ->join('users u2', 'u2.id = pengeluaran.approved_by', 'left')
            ->where('pengeluaran.deleted_at IS NULL');

        if (! empty($filters['kategori'])) {
            $builder->where('pengeluaran.kategori', $filters['kategori']);
        }
        if (! empty($filters['approval_status'])) {
            $builder->where('pengeluaran.approval_status', $filters['approval_status']);
        }
        if (! empty($filters['rumah_walet_id'])) {
            $builder->where('pengeluaran.rumah_walet_id', $filters['rumah_walet_id']);
        }
        if (! empty($filters['dari'])) {
            $builder->where('pengeluaran.tanggal >=', $filters['dari']);
        }
        if (! empty($filters['sampai'])) {
            $builder->where('pengeluaran.tanggal <=', $filters['sampai']);
        }

        return $builder->orderBy('pengeluaran.tanggal', 'DESC')->get()->getResultArray();

SELECT *
FROM `pengeluaran`
WHERE `approval_status` = 'pending'
AND `deleted_at` IS NULL
AND `pengeluaran`.`deleted_at` IS NULL
ORDER BY `tanggal` DESC
---
    public function getPendingApprovals(): array
    {
        return $this->where('approval_status', 'pending')
            ->where('deleted_at IS NULL')
            ->orderBy('tanggal', 'DESC')
            ->findAll();