app/Models/PenjualanDetailModel.php

    public function getByPenjualanId(int $penjualanId): array
    {
        return $this->select('penjualan_detail.*, rw.kode AS rw_kode, rw.nama AS rw_nama, hp.no_batch')
            ->join('rumah_walet rw', 'rw.id = penjualan_detail.rumah_walet_id', 'left')
            ->join('hasil_panen hp', 'hp.id = penjualan_detail.hasil_panen_id', 'left')
            ->where('penjualan_id', $penjualanId)
            ->findAll();
---
SELECT `penjualan_detail`.*, `rw`.`kode` AS `rw_kode`, `rw`.`nama` AS `rw_nama`, `hp`.`no_batch`
FROM `penjualan_detail`
LEFT JOIN `rumah_walet` `rw` ON `rw`.`id` = `penjualan_detail`.`rumah_walet_id`
LEFT JOIN `hasil_panen` `hp` ON `hp`.`id` = `penjualan_detail`.`hasil_panen_id`
WHERE `penjualan_id` = 18