app/Models/PenjualanModel.php

    public function getAllFiltered(array $filters = [])
    {
        $builder = $this->builder();
        $builder->where('deleted_at IS NULL');

        if (! empty($filters['dari'])) {
            $builder->where('tanggal >=', $filters['dari']);
        }
        if (! empty($filters['sampai'])) {
            $builder->where('tanggal <=', $filters['sampai']);
        }
        if (! empty($filters['status_bayar'])) {
            $builder->where('status_bayar', $filters['status_bayar']);
        }
        if (! empty($filters['pembeli'])) {
            $builder->like('pembeli_nama', $filters['pembeli']);
        }

        return $builder->orderBy('tanggal', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `penjualan`
WHERE `deleted_at` IS NULL
ORDER BY `tanggal` DESC