app/Models/RumahWaletModel.php

SELECT *
FROM `rumah_walet`
WHERE `status` = 'aktif'
AND `rumah_walet`.`deleted_at` IS NULL
ORDER BY `kode` ASC
---
    public function getAktif()
    {
        return $this->where('status', 'aktif')->orderBy('kode', 'ASC')->findAll();