app/Models/StokSarangModel.php

    public function getWithRelations(array $filters = [])
    {
        $builder = $this->builder();
        $builder->select('stok_sarang.*, rumah_walet.kode AS rw_kode, rumah_walet.nama AS rw_nama, p.no_invoice')
            ->join('rumah_walet', 'rumah_walet.id = stok_sarang.rumah_walet_id', 'left')
            ->join('penjualan p', 'p.id = stok_sarang.penjualan_id', 'left')
            ->where('stok_sarang.deleted_at IS NULL');

        if (! empty($filters['status_stok'])) {
            $builder->where('stok_sarang.status_stok', $filters['status_stok']);
        }
        if (! empty($filters['lokasi_gudang'])) {
            $builder->where('stok_sarang.lokasi_gudang', $filters['lokasi_gudang']);
        }
        if (! empty($filters['rumah_walet_id'])) {
            $builder->where('stok_sarang.rumah_walet_id', $filters['rumah_walet_id']);
        }
        if (! empty($filters['grade'])) {
            $builder->where('stok_sarang.grade', $filters['grade']);
        }

        return $builder->orderBy('stok_sarang.tanggal_masuk', 'DESC')->get()->getResultArray();
---
SELECT `stok_sarang`.*, `rumah_walet`.`kode` AS `rw_kode`, `rumah_walet`.`nama` AS `rw_nama`, `p`.`no_invoice`
FROM `stok_sarang`
LEFT JOIN `rumah_walet` ON `rumah_walet`.`id` = `stok_sarang`.`rumah_walet_id`
LEFT JOIN `penjualan` `p` ON `p`.`id` = `stok_sarang`.`penjualan_id`
WHERE `stok_sarang`.`deleted_at` IS NULL
AND `stok_sarang`.`status_stok` = 'tersedia'
ORDER BY `stok_sarang`.`tanggal_masuk` DESC

    public function getSummary(): array
    {
        $db = \Config\Database::connect();
        return $db->table('stok_sarang')
            ->select('grade, jenis_panen, lokasi_gudang, status_stok, COUNT(*) AS jumlah, SUM(berat_kg) AS total_berat')
            ->where('deleted_at IS NULL')
            ->groupBy('grade, jenis_panen, lokasi_gudang, status_stok')
            ->orderBy('grade', 'ASC')
            ->get()->getResultArray();
---
SELECT `grade`, `jenis_panen`, `lokasi_gudang`, `status_stok`, COUNT(*) AS jumlah, SUM(berat_kg) AS total_berat
FROM `stok_sarang`
WHERE `deleted_at` IS NULL
GROUP BY `grade`, `jenis_panen`, `lokasi_gudang`, `status_stok`
ORDER BY `grade` ASC